TexasInstruments/mcupsdk-core-k3/test/drivers/mmcsd/test_mmcsd_system/am62px-sk/wkup-r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Px" --part "Default" --package "AMH" --context "wkup-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM62P" --package "FCBGA (AMH)" --variant "AM62P54-M" --context "wkup-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.26.2+4477"}
 */

/**
 * Import the modules used in this configuration.
 */
const ipc           = scripting.addModule("/drivers/ipc/ipc");
const uart          = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1         = uart.addInstance();
const freertos_fat  = scripting.addModule("/fs/freertos_fat/freertos_fat", {}, false);
const freertos_fat1 = freertos_fat.addInstance();
const clock         = scripting.addModule("/kernel/dpl/clock");
const debug_log     = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7     = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71    = mpu_armv7.addInstance();
const mpu_armv72    = mpu_armv7.addInstance();
const mpu_armv73    = mpu_armv7.addInstance();
const mpu_armv74    = mpu_armv7.addInstance();
const mpu_armv75    = mpu_armv7.addInstance();
const mpu_armv76    = mpu_armv7.addInstance();
const mpu_armv77    = mpu_armv7.addInstance();
const mpu_armv78    = mpu_armv7.addInstance();
const mpu_armv79    = mpu_armv7.addInstance();
const mpu_armv710   = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
ipc.mcu_r5fss0_0   = "notify";
ipc.enableLinuxIpc = false;

uart1.$name                      = "CONFIG_UART_SBL";
uart1.useWakeupDomainPeripherals = false;
uart1.intrEnable                 = "DISABLE";
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", uart1.UART, "RXD");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", uart1.UART, "TXD");

freertos_fat1.$name                  = "CONFIG_FREERTOS_FAT0";
freertos_fat1.media                  = "EMMC";
freertos_fat1.peripheralDriver.$name = "CONFIG_MMCSD_EMMC";

debug_log.enableUartLog            = true;
debug_log.enableSharedMemLog       = true;
debug_log.enableSharedMemLogReader = true;
debug_log.enableCssLog             = false;
debug_log.uartTrace                = true;
debug_log.uartLog.$name            = "CONFIG_UART0";

mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.$name             = "REGISTER_REGION";

mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.size              = 7;
mpu_armv72.$name             = "TCMA_VEC";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.baseAddr          = 0x41C00000;
mpu_armv73.size              = 19;

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 16;

mpu_armv75.$name    = "DDR";
mpu_armv75.baseAddr = 0x80000000;
mpu_armv75.size     = 31;

mpu_armv76.baseAddr   = 0x41010000;
mpu_armv76.size       = 15;
mpu_armv76.attributes = "NonCached";
mpu_armv76.$name      = "TCMB";

mpu_armv77.size       = 15;
mpu_armv77.attributes = "NonCached";
mpu_armv77.$name      = "TCMA";

mpu_armv78.baseAddr = 0x43C00000;
mpu_armv78.size     = 18;
mpu_armv78.$name    = "HSM_RAM";

mpu_armv79.$name        = "RTOS_NORTOS_IPC_VRING1";
mpu_armv79.baseAddr     = 0x9B500000;
mpu_armv79.allowExecute = false;
mpu_armv79.attributes   = "NonCached";
mpu_armv79.size         = 20;

mpu_armv710.$name      = "LOG_SHM_MEM";
mpu_armv710.baseAddr   = 0xA1000000;
mpu_armv710.attributes = "NonCached";
mpu_armv710.size       = 18;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
uart1.UART.$suggestSolution                          = "USART1";
uart1.UART.RXD.$suggestSolution                      = "I2C1_SCL";
uart1.UART.TXD.$suggestSolution                      = "I2C1_SDA";
freertos_fat1.peripheralDriver.MMC0.$suggestSolution = "MMC0";
debug_log.uartLog.WKUP_UART.$suggestSolution         = "WKUP_USART0";
debug_log.uartLog.WKUP_UART.RXD.$suggestSolution     = "WKUP_UART0_RXD";
debug_log.uartLog.WKUP_UART.TXD.$suggestSolution     = "WKUP_UART0_TXD";
